# GetDisplacedElementIds Method (View) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..GetDisplacedElementIds Method (View)
DisplacementElement Class See Also
---
Returns the element ids of all displaced elements in the specified view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static ICollection<ElementId> GetDisplacedElementIds(
	View view
)
```

Visual Basic
---
```text
Public Shared Function GetDisplacedElementIds ( _
	view As View _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetDisplacedElementIds(
	View^ view
)
```

# ### Parameters
view
    Type: Autodesk.Revit.DB..::..View The view.
# ### Return Value
The element ids.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DisplacementElement Class
GetDisplacedElementIds Overload
Autodesk.Revit.DB Namespace